In [35]:
import pandas as pd
import numpy as np

# Fixed 'Dataframe' to 'DataFrame' (capital 'F')
# Added missing comma between "delhi" and "banglore"
india_weather = pd.DataFrame({
    "city": ["mumbai", "delhi", "banglore"],
    "humidity": [80, 60, 78],
        "temperature": [32, 45, 30]
},index = [1,2,3])
india_weather

       city  humidity  temperature
1    mumbai        80           32
2     delhi        60           45
3  banglore        78           30

In [39]:
us_weather = pd.DataFrame({
    "city": ["new york", "chicago", "orlando"],
    "humidity": [68, 65, 75],
     "temperature": [21, 14, 35]
},index = [4,5,6])
us_weather  # Corrected variable name to match the definition above

       city  humidity  temperature
4  new york        68           21
5   chicago        65           14
6   orlando        75           35

In [40]:
# Concatenate the india_weather and us_weather dataframes vertically into a single dataframe
df = pd.concat([india_weather,us_weather])
# Display the combined dataframe
df

       city  humidity  temperature
1    mumbai        80           32
2     delhi        60           45
3  banglore        78           30
4  new york        68           21
5   chicago        65           14
6   orlando        75           35

In [41]:
# Concatenate india_weather and us_weather dataframes into a single dataframe
# ignore_index=True resets the index of the combined dataframe to avoid duplicate indices
df = pd.concat([india_weather,us_weather],ignore_index = True)
df  # Display the concatenated dataframe

       city  humidity  temperature
0    mumbai        80           32
1     delhi        60           45
2  banglore        78           30
3  new york        68           21
4   chicago        65           14
5   orlando        75           35

In [42]:
# Concatenate india_weather and us_weather DataFrames vertically
# The 'keys' parameter adds a hierarchical index with 'India' and 'Usa' labels
# This creates a multi-index DataFrame where the first level identifies the source DataFrame
df = pd.concat([india_weather,us_weather],keys = ['India','Usa'])
df  # Display the concatenated DataFrame with hierarchical index

             city  humidity  temperature
India 1    mumbai        80           32
      2     delhi        60           45
      3  banglore        78           30
Usa   4  new york        68           21
      5   chicago        65           14
      6   orlando        75           35

In [43]:
df.loc['India']

       city  humidity  temperature
1    mumbai        80           32
2     delhi        60           45
3  banglore        78           30

In [44]:
# Temperature DataFrame
temperature_df = pd.DataFrame({
    "city": ["mumbai", "delhi", "banglore"],
    "temperature": [32, 45, 30]
})
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [45]:
windspeed_df = pd.DataFrame({
    "city": ["mumbai", "delhi",'banglore'],
    "windspeed": [7, 12,9]
})
windspeed_df

       city  windspeed
0    mumbai          7
1     delhi         12
2  banglore          9

In [46]:
# Combine temperature and windspeed dataframes horizontally (side by side)
# axis=1 means concatenation happens along columns (not rows)
pd.concat([temperature_df, windspeed_df], axis=1)

       city  temperature      city  windspeed
0    mumbai           32    mumbai          7
1     delhi           45     delhi         12
2  banglore           30  banglore          9

In [49]:
# Create a pandas Series with weather events and name it "event"
s = pd.Series(['Humid','Dry','Rain'] , name = "event")
# Display the Series
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [53]:
# Concatenate the temperature_df DataFrame with series s horizontally (along columns)
pd.concat([temperature_df,s],axis = 1)

       city  temperature  event
0    mumbai           32  Humid
1     delhi           45    Dry
2  banglore           30   Rain